Documents/РасходСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РасходСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммыВТабЧасти</Name>
					<Comment>истина-используется таб часть, ложь-реквизит шапки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>для недельного планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БюджетГод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьОвер</Name>
					<Comment>иногда надо провести не в кредит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоходыРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьДатуЗапретаРедактирования()

	Возврат Константы.ДатаЗапретаРедактирования.Получить();

КонецФункции // ПолучитьДатуЗапретаРедактирования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НачалоДня(Объект.Дата)<=ПолучитьДатуЗапретаРедактирования() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УправлениеВидимостьюКлиент();
	
	//Если Не ЗначениеЗаполнено(Объект.Валюта) И ЗначениеЗаполнено(Объект.Кошелек) Тогда
	//	Объект.Валюта = Получитьва
	//	ВалютаПриИзменении(Неопределено);
	//ИначеЕсли Не ЗначениеЗаполнено(Объект.Валюта) Тогда
	//	Объект.Валюта = ПолучитьВалютуРеглУчетаСервер();
	//	ВалютаПриИзменении(Неопределено);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	
	Элементы.ДетализацияПоНоменклатуре.Видимость = Объект.СуммыВТабЧасти;
	
	Элементы.Контрагент.Видимость = Объект.ДетализацияПоНоменклатуре;
	
	Элементы.ДоходыРасходыНоменклатура.Видимость = Объект.ДетализацияПоНоменклатуре;
	Элементы.ДоходыРасходыКоличество.Видимость = Объект.ДетализацияПоНоменклатуре;
	
	Элементы.СуммаТЧ.Видимость = Объект.СуммыВТабЧасти;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоНоменклатуреПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
	Если НЕ Объект.ДетализацияПоНоменклатуре Тогда
		Объект.Контрагент = "";
		Для каждого Стр Из Объект.ДоходыРасходы Цикл
			Стр.Номенклатура = "";
			Стр.Количество = 0;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.Курс = Курс.Курс;
	Объект.Кратность = Курс.Кратность;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуРеглУчетаСервер()
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если ЗначениеЗаполнено(ЭтаФорма.Параметры.СтатьяДР) Тогда
	//	НовСтр = Объект.ДоходыРасходы.Добавить();
	//	НовСтр.СтатьяДР = ЭтаФорма.Параметры.СтатьяДР;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СуммыВТабЧастиПриИзменении(Элемент)
	УправлениеВидимостьюКлиент()
КонецПроцедуры


&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	Объект.Валюта = ПолучитьВалютуВалютуКошелькаСервер(Объект.Кошелек);
	ВалютаПриИзменении(Неопределено)
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьВалютуВалютуКошелькаСервер(Кошелек)
	Возврат Кошелек.Валюта;
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//ВалютаПриИзменении(Неопределено)
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьДопРасходы(Команда)
	Всего = 0;
	Для каждого Стр Из Объект.ДоходыРасходы Цикл
		Всего = Всего + Стр.Сумма;
	КонецЦикла;
	
	Если Всего =0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Объект.ДоходыРасходы Цикл
		Стр.ДопСумма = Стр.Сумма / Всего * Объект.ДопРасходы;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДату(Команда)
	ДеньМесяца = Число(этаформа.ТекущийЭлемент.Заголовок);
	Объект.Дата = Дата(Год(Объект.Дата), Месяц(Объект.Дата), ДеньМесяца);
	Модифицированность = Истина;
КонецПроцедуры
